<template>
  <div class="rubbish-class">
    <div class="img">
      <img src="../../assets/images/environmental-protection.jpg" alt="">
    </div>
    <div class="text-content">
      <div class="text-context-container">
        <div class="paragraph brief-introduction">
          <div class="h1-box">
            <h1>垃圾分类</h1>
          </div>
          <p>
            垃圾分类（Garbage classification），一般是指按一定规定或标准将垃圾分类储存、投放和搬运，从而转变成公共资源的一系列活动的总称。
          </p>
          <p>
            垃圾分类的目的是提高垃圾的资源价值和经济价值，减少垃圾处理量和处理设备的使用，降低处理成本，减少土地资源的消耗，具有社会、经济、生态等几方面的效益。
          </p>
          <p>
            垃圾在分类储存阶段属于公众的私有品，垃圾经公众分类投放后成为公众所在小区或社区的区域性公共资源，垃圾分类搬运到垃圾集中点或转运站后成为没有排除性的公共资源。从国内外各城市对生活垃圾分类的方法来看，大多都是根据垃圾的成分、产生量，结合本地垃圾的资源利用和处理方式等来进行分类的。
          </p>
        </div>

        <div class="paragraph cause">
          <div class="h2-box">
            <h2>产生原因</h2>
          </div>
          <p>
            每个人每天都会扔出许多垃圾，在一些垃圾管理较好的地区，大部分垃圾会得到卫生填埋、焚烧、堆肥等无害化处理，而更多地方的垃圾则常常被简易堆放或填埋，导致臭气蔓延，并且污染土壤和地下水。
          </p>
          <div class="lajitui-img">
            <img src="../../assets/images/lajidui.webp" alt="">
            <img src="../../assets/images/lajidui2.jpg" alt="">
            <img src="../../assets/images/lajidui3.jpg" alt="">
          </div>
          <p>
            垃圾无害化处理的费用是非常高的，根据处理方式的不同，处理一吨垃圾的费用约为一百元至几百元不等。人们大量地消耗资源，大规模生产，大量地消费，又大量地生产着垃圾。后果将不堪设想。
          </p>
          <p>
            从国外各城市对生活垃圾分类的方法来看，大致都是根据垃圾的成分构成、产生量，结合本地垃圾的资源利用和处理方式来进行分类。如德国一般分为纸、玻璃、金属和塑料等；澳大利亚一般分为可堆肥垃圾，可回收垃圾，不可回收垃圾；日本一般分为塑料瓶类，可回收塑料、其他塑料、资源垃圾、大型垃圾、可燃垃圾、不可燃垃圾和有害垃圾等等。
          </p>
        </div>

        <div class="paragraph principle">
          <div class="h2-box">
            <h2>分类原则</h2>
          </div>
          <h3>分而用之</h3>
          <p>
            分类的目的就是为了将废弃物分流处理，利用现有生产制造能力，回收利用回收品，包括物质利用和能量利用，填埋处置暂时无法利用的无用垃圾。
          </p>
          <h3>因地制宜</h3>
          <p>
            各地、各区、各社（区）、各小区地理、经济发展水平、企业回收利用废弃物的能力、居民来源、生活习惯、经济与心理承担能力等各不相同。
          </p>
          <h3>自觉自治</h3>
          <p>
            社区和居民，包括企事业单位，逐步养成“减量、循环、自觉、自治”的行为规范，创新垃圾分类处理模式，成为垃圾减量、分类、回收和利用的主力军。
          </p>
          <h3>减排补贴 超排惩罚</h3>
          <p>
            制定单位和居民垃圾排放量标准，低于这一排放量标准的给予补贴；超过这一排放量标准的则予以惩罚。减排越多补贴越多，超排越多惩罚越重，以此提高单位和居民实行源头减量和排放控制的积极性。
          </p>
          <h3>捆绑服务 注重绩效</h3>
          <p>
            在居民还没有自愿和自觉行动而居（村）委和政府的资源又不足时，推动分类排放需要物业管理公司和其他企业介入。但是，仅仅承接分类排放难以获利，企业不可能介入，而推行捆绑服务就能要解决这个问题。将推动分类排放服务与垃圾收运、干湿垃圾处理业务捆绑，可促进垃圾分类资本化，保障企业合理盈利。</p>
          <p>垃圾分类回收说难不难，分而用之实为关键，因地制宜提供方便，自觉自治行为规范。</p>
        </div>

        <div class="paragraph meaning">
          <div class="h2-box">
            <h2>分类意义</h2>
          </div>

          <p>
            垃圾分类是垃圾终端处理设施运转的基础，实施生活垃圾分类，可以有效改善城乡环境，促进资源回收利用。应在生活垃圾科学合理分类的基础上，对应开展生活垃圾分类配套体系建设，根据分类品种建立与垃圾分类相配套的收运体系、建立与再生资源利用相协调的回收体系，完善与垃圾分类相衔接的终端处理设施，以确保分类收运、回收、利用和处理设施相互衔接。只有做好垃圾分类，垃圾回收及处理等配套系统才能更高效地运转。垃圾分类处理关系到资源节约型、环境友好型社会的建设，有利于我国新型城镇化质量和生态文明建设水平的进一步提高。
          </p>

          <p>垃圾分类处理的优点如下：</p>

          <h3>一</h3>

          <p>
            减少占地。垃圾分类，去掉能回收的，不易降解的物质，减少垃圾数量达50%以上。
          </p>

          <h3>二</h3>

          <p>
            减少环境污染。废弃的电池等含有金属汞等有毒物质，会对人类产生严重的威胁，废塑料进入土壤，会导致农作物减产，因此回收利用可以减少这些危害。
          </p>

          <h3>三</h3>

          <p>
            变废为宝。1吨废塑料可回炼600公斤无铅汽油和柴油。回收1500吨废纸，可避免砍伐用于生产1200吨纸的林木。因此，垃圾回收既环保，又节约资源。
          </p>
        </div>

        <div class="paragraph variety">
          <div class="h2-box">
            <h2>垃圾种类</h2>
          </div>

          <h3>可回收物</h3>

          <p>可回收物主要包括废纸、塑料、玻璃、金属和布料五大类。</p>
          <p>废纸：主要包括报纸、期刊、图书、各种包装纸等。但是，要注意纸巾和厕所纸由于水溶性太强不可回收。</p>
          <p>塑料：各种塑料袋、塑料泡沫、塑料包装（快递包装纸是其他垃圾/干垃圾）、一次性塑料餐盒餐具、硬塑料、塑料牙刷、塑料杯子、矿泉水瓶等。</p>
          <p>玻璃：主要包括各种玻璃瓶、碎玻璃片、暖瓶等。（镜子是其他垃圾/干垃圾）</p>
          <p>金属物：主要包括易拉罐、罐头盒等。</p>
          <p>布料：主要包括废弃衣服、桌布、洗脸巾、书包、鞋等。</p>
          <p>这些垃圾通过综合处理回收利用，可以减少污染，节省资源。如每回收1吨废纸可造好纸850公斤，节省木材300公斤，比等量生产减少污染74%；每回收1吨塑料饮料瓶可获得0.7吨二级原料；每回收1吨废钢铁可炼好钢0.9吨，比用矿石冶炼节约成本47%，减少空气污染75%，减少97%的水污染和固体废物。</p>
          <h3>其他垃圾</h3>
          <p>
            其他垃圾（上海称干垃圾）包括除上述几类垃圾之外的砖瓦陶瓷、渣土、卫生间废纸、纸巾等难以回收的废弃物及尘土、食品袋（盒）。采取卫生填埋可有效减少对地下水、地表水、土壤及空气的污染。
          </p>
          <p>
            大棒骨因为“难腐蚀”被列入“其它垃圾”。玉米核、坚果壳、果核、鸡骨等则是餐厨垃圾。
          </p>
          <p>
            卫生纸：厕纸、卫生纸遇水即溶，不算可回收的“纸张”，类似的还有烟盒等。
          </p>
          <p>
            餐厨垃圾装袋：常用的塑料袋，即使是可以降解的也远比餐厨垃圾更难腐蚀。此外塑料袋本身是可回收垃圾。正确做法应该是将餐厨垃圾倒入垃圾桶，塑料袋另扔进“可回收垃圾”桶。
          </p>

          <p>
            果壳：在垃圾分类中，“果壳瓜皮”的标识就是花生壳，的确属于厨余垃圾。家里用剩的废弃食用油，也归类在“厨余垃圾”。
          </p>

          <p>
            尘土：在垃圾分类中，尘土属于“其它垃圾”，但残枝落叶属于“厨余垃圾”，包括家里开败的鲜花等。
          </p>

          <h3>厨余垃圾</h3>
          <p>
            厨余垃圾（上海称湿垃圾）包括剩菜剩饭、骨头、菜根菜叶、果皮等食品类废物。经生物技术就地处理堆肥，每吨可生产0.6~0.7吨有机肥料。
          </p>

          <h3>有害垃圾</h3>
          <p>
            有害垃圾含有对人体健康有害的重金属、有毒的物质或者对环境造成现实危害或者潜在危害的废弃物。包括电池、荧光灯管、灯泡、水银温度计、油漆桶、部分家电、过期药品及其容器、过期化妆品等。这些垃圾一般使用单独回收或填埋处理。
          </p>

          <div>

          </div>
        </div>

        <div class="paragraph  main-problems">
          <div class="h2-box">
            <h2>主要问题</h2>
          </div>
          <h3>回收萎缩</h3>
          <p>
            国营垃圾回收日见萎缩。中国是最早提出垃圾分类收集的国家之一。就拿北京为例：1965年，二环路以内，国营废品收购站有2000多个。20世纪80年代后，其规模严重萎缩；1997年，三环路以内的国营废品收购站仅剩16个。
          </p>
          <h3>拾荒大军</h3>
          <p>
            拾荒大军取而代之问题多多。8.2万多的拾荒者，每年从北京“捡走”9.3亿元，同时还将废弃物转化成为新的资源，客观上减轻了政府处理垃圾的负担，减少18亿元的处理费用，延长了垃圾填埋处理场的使用寿命。但是，这些民间自发的拾荒者，均是无照经营，缺乏规范、检验和约束，致使垃圾在捡拾、收集、运输、加工过程中造成严重的二次污染，他们自身的传染病发病率也较高。
          </p>
          <h3>垃圾道</h3>
          <p>
            垃圾道成为百姓的苦恼。北京如今高楼林立，垃圾道成为许多地方的卫生死角，脏乱不堪的垃圾道口，蚊蝇十分张狂，加上拾荒者的胡乱翻找，使得居民们每当走过时必捂鼻而过，底层的住户可就无法逃避，在炎热的夏季也不敢打开门户。老百姓期待新型垃圾回收办法的实施。
          </p>

          <h3>袋装垃圾</h3>

          <p>
            袋装垃圾并非长久之计。北京一些地方开始实行封闭垃圾道，用塑料袋装垃圾定时回收的办法，以减少垃圾露天堆放对环境的影响。2000年2~5月期间，北京组织了“发展绿色流通，倡导绿色消费”的一次大型绿色消费调查。调查结果表明：消费者使用后的商场购物袋重复使用的占89.91%，其中，充当垃圾袋的占57.05%.
          </p>

          <h3>不懂垃圾分类</h3>

          <p>
            分类垃圾桶的困惑。北京一些街边虽然采用了分类垃圾桶，但许多人不知如何进行分类投放，不知道什么是可回收的垃圾。在一些社区，由于民间环保组织的倡导，也开展了垃圾分类的尝试，但环卫局的垃圾车又把分类好的垃圾倒到一起运走了，严重挫伤了百姓的环保积极性，产生了负面影响。可见，没有完整的收购、运输、销售、加工、成品市场等组织的再利用产业体系的支持，垃圾分类无法产生经济效益，只能是劳民伤财的空忙。
          </p>

          <h3>埋不胜埋，烧不胜烧</h3>

          <p>随着经济的发展和人民生活水平的提高，垃圾问题日益突出。中国668座城市，2/3被垃圾环带包围。这些垃圾埋不胜埋，烧不胜烧，造成了一系列严重危害。</p>
          <p>
            垃圾资源化潜力随着生活水平和经济的发展也不断增长。在垃圾成分中，金属、纸类、塑料、玻璃被视为可直接回收利用的资源，占垃圾总量的42.9%，可直接回收利用率应不低于33%。
          </p>
        </div>

        <div class="paragraph solution">
          <div class="h2-box">
            <h2>解决方法</h2>
          </div>

          <h3>一.依靠社区消费者</h3>
          <p>
            面对此现状，首先一定要尽快规范拾荒者的经营行为，加强引导和管理，在使其减少对社会不良影响的前提下，实现从无序到有序的经营企业的转变，充分发挥垃圾分类回收利用的作用。更重要的是，必须建立更加超前的消费者分类回收体系。
          </p>
          <h3>二.树立垃圾分类的观念</h3>
          <p>
            广泛开展垃圾分类的宣传、教育和倡导工作，使消费者树立垃圾分类的环保意识，阐明垃圾对社会生活造成的严重危害，宣传垃圾分类的重要意义，呼吁消费者积极参与垃圾分类。同时教会消费者垃圾分类的知识，使消费者进行垃圾分类逐渐成为自觉和习惯性行为。
          </p>

          <h3>三.改造或增设垃圾分类回收的设施</h3>
          <p>
            可将一个垃圾桶分割成几个隔段或建立几个独立的分类垃圾桶。垃圾分类应逐步细化。垃圾分类搞得越细越精，越有利于回收利用。可以用不同颜色的垃圾桶分别回收玻璃、纸、塑料和金属类包装垃圾、植物垃圾、生活垃圾、电池灯泡等特殊的垃圾。垃圾桶上必须注明回收的类别和简要使用说明，指导消费者使用。垃圾桶也可以成为企业广告的载体，企业可以承担制作费用。
          </p>
          <p>
            社区回收站可由社区物业或居委会负责管理，建立现代社区的垃圾经营和回收服务功能，使垃圾回收成为其创收的途径，贴补消费者卫生保洁费用的不足。政府可实行减免经营税的倾斜政策，来调动社区的管理积极性。新建小区更是要合理规划垃圾回收站，逐渐成为审批和验收的必备条件，强化新型社区的综合功能。
          </p>
          <h3>四.改善垃圾储运形式</h3>
          <p>
            对一些体积大的垃圾，应该压缩后进行储运。尤应注意的是，要对环卫局的垃圾回收车进行分隔式的改造，分类装载垃圾。充分发挥原有垃圾回收渠道的作用，将可再生利用的垃圾转卖到企业。另外，建立垃圾下游产业的专门回收队伍，由厂家直接回收，实现多渠道回收，引入价格和服务的竞争机制，以此提高他们的服务质量和垃圾的回收率。
          </p>
          <h3>五.实行家庭短期收集，定期分时段分类回收</h3>

          <p>
            可以将垃圾分类一星期内暂时由家庭保管，环卫每天早晨收集容易腐烂的菜叶等餐厨垃圾，每天中午收集可以回收利用的垃圾和建筑垃圾等，晚上收集其他垃圾。社区或物业管理部门定期对新来户上门指导或发宣传册，让居民都知道如何垃圾分类。有条件的地方，还要定期播放学习国外环保收集垃圾的视频，提高本地区居民的素质，养成爱护环境就是爱护自己的习惯。
          </p>
        </div>

        <div class="paragraph wrong-region">
          <div class="h2-box">
            <h2>垃圾分类小误区</h2>
          </div>

          <h3>误区一：纸巾也是纸，可以回收利用</h3>
          <p>
            可回收的废纸主要包括报纸、期刊、图书、各种包装纸等（污染严重的纸除外）。在一般的认知中，纸巾属于纸张的一种，是可回收的。但实际上，厕纸遇水即溶，不算可回收的“纸张”。类似的还有餐巾纸、厨房用纸等，都属于“其他垃圾”。
          </p>
          <div class="img">
            <img src='../../assets/images/toilet-paper.jpg' alt="">
          </div>
          <h3>误区二：过期食品都是厨余垃圾</h3>
          <p>
            过期食品，比如一包受潮过期的瓜子，可以连带包装物一起丢进垃圾桶吗？这样做明显不妥！因为瓜子容易腐烂，而包装物（如塑料包装袋）装过这些过期的食品，已经被污染了，那么这些就都应该丢进“其他垃圾”桶。
          </p>
          <div class="img">
            <img src="../../assets/images/food.jpg" alt="">
          </div>
          <h3>误区三：喝剩的饮料瓶、易拉罐可直接投入可回收垃圾桶</h3>
          <p>
            塑料饮料瓶里剩下的液体，属于纯流质的食物垃圾，应先将液体直接倒进下水口，再将塑料饮料瓶冲洗干净后压扁，方可投放到“可回收物”垃圾桶中。这样既可以减少环卫工人的工作量，又可以压缩塑料瓶的体积，方便运输。类似的还有装可乐的易拉罐、装牛奶的利乐包装等，都需要清洗后才能成为可回收物。
          </p>
          <div class="img">
            <img src="../../assets/images/ring-pull-can.jpg" alt="">
          </div>
          <h3>误区四：枯枝败叶是其他垃圾</h3>
          <p>
            大骨头虽然也是“剩菜残羹”，但因为其难腐蚀，且质地坚硬不易粉碎，容易损坏厨余垃圾末端处理设备而被列入“其他垃圾”，类似的还有榴莲壳、椰子壳等，但鸡骨、鱼骨、玉米棒、苹果核等较软易腐蚀的属于厨余垃圾。
          </p>
          <div class="img">
            <img src="../../assets/images/leaf.jpg" alt="">
          </div>
          <h3>误区五：电池都是有害垃圾</h3>
          <p>
            我们日常使用的1号、5号、7号等干电池都是无汞电池，不含有毒有害物质，不属于有害垃圾。但可多次使用的充电电池、手机电池、镍镉电池、锂电池、铅蓄电池、钮扣电池等含大量重金属，应将其集中放置在社区、酒店宾馆、学校、大型商场超市等设置的电池回收箱或有害垃圾桶，由专业回收机构收集处理。
          </p>
        </div>

      </div>
    </div>
    <RightButtonLink v-for="(item, index) in rightButtons" :key="index" :style="{top: index * 100 + 100 + 'px'}"
                     :class="[rightButtonActiveIndex === index ? 'active':'']"
                     @mouseenter="handleShowActiveClass(index)" @mouseleave="handleHideActiveClass" :to="item.path">
      {{ item.text }}
    </RightButtonLink>
  </div>
</template>

<script>
import RightButtonLink from "../../components/RightButtonLink/index.vue"
import {ref} from "vue";
export default {
  name: "index",
  components:{
    RightButtonLink,
  },
  setup() {
    let rightButtonActiveIndex = ref(false);

    let rightButtons = [
      {
        text: '首页',
        path: "/home"
      },
      {
        text: '2021全国各省垃圾产量',
        path: "/provinceRanking"
      },
      {
        text: '垃圾分类考试',
        path: "/examination"
      }
    ]

    function handleShowActiveClass(index) {
      rightButtonActiveIndex.value = index;
    }

    function handleHideActiveClass() {
      rightButtonActiveIndex.value = null;
    }

    return {
      handleShowActiveClass,
      handleHideActiveClass,
      rightButtons,
      rightButtonActiveIndex,
    }
  }
}
</script>

<style scoped lang="less">
.rubbish-class {
  width: 100%;
  height: 100%;
  background-color: #f5f5f5;
  overflow-x: hidden;

  .img img {
    object-fit: contain;
  }

  .text-content {
    background-color: #f5f5f5;
    z-index: 2;

    .text-context-container {
      position: relative;
      top: -200px;
      margin: 0 auto;
      background: #fff;
      width: 1137px;
      border: 1px solid #e5e5e5;
      padding: 29px 29px 0;

      .h1-box {
        margin: 0 0 5px;
        line-height: 39px;
        h1 {
          margin: 0 10px 0 0;
          display: inline;
          font-size: 34px;
          line-height: 1.15;
          font-weight: 400;
          vertical-align: sub;
        }
      }

      p {
        text-indent: 2em;
        font-size: 16px;
        word-wrap: break-word;
        color: #333;
        margin-bottom: 15px;
        line-height: 24px;
        zoom: 1;
      }

      .img {
        text-align: center;
        margin-bottom: 20px;
      }

      h3 {
        font-size: 20px;
        font-weight: 400;
        color: #333;
        margin-bottom: 5px;
      }

      .h2-box {
        display: block;
        clear: both;
        font-size: 20px;
        border-left: 12px solid #4F9CEE;
        line-height: 24px;
        font-size: 22px;
        font-weight: 400;
        font-family: Microsoft YaHei,SimHei,Verdana;
        margin: 35px 0 15px -30px;
        background: url(https://bkssl.bdimg.com/static/wiki-lemma/normal/resource/img/paraTitle-line_743dba1.png);
        position: relative;
        overflow: hidden;

        h2 {
          float: left;
          display: block;
          padding: 0 8px 0 18px;
          line-height: 24px;
          font-size: 22px;
          font-weight: 400;
          color: #000;
          background: #fff;
        }
      }

      .paragraph {
        margin-bottom: 40px;
      }
    }
  }

  .lajitui-img {
    display: flex;
    flex-direction: row;
    justify-content: space-around;
    align-items: center;

    img {
      width: 300px;
      height: 200px;
    }
  }
}


</style>